ms-azuretools.vscode-docker-2.0.0
visualstudioexptteam.intellicode-api-usage-examples-0.2.9
anysphere.pyright-1.1.327-universal
vscjava.vscode-gradle-3.17.0
redhat.java-1.45.0-darwin-arm64
visualstudioexptteam.intellicode-api-usage-examples-0.2.8
ms-vscode.cpptools-extension-pack-1.3.1
samuelepignone.fakedonalds-0.0.1
vscjava.vscode-java-dependency-0.25.0-universal
robbowen.synthwave-vscode-0.1.20-universal
vscjava.vscode-java-pack-0.30.1
ms-python.debugpy-2025.10.0-darwin-arm64
ms-vscode-remote.remote-wsl-0.88.5
ms-python.python-2024.14.1-darwin-arm64
pkief.material-icon-theme-5.27.0
ms-vscode.cpptools-themes-2.0.0
visualstudioexptteam.vscodeintellicode-1.3.2
redhat.java-1.46.0-darwin-arm64
somekittens.hot-dog-stand-6.6.9
vscjava.vscode-java-dependency-0.25.2025092303
ms-python.vscode-pylance-2025.4.1
ms-vscode-remote.remote-containers-0.394.0
formulahendry.code-runner-0.12.2
pkief.material-icon-theme-5.27.0-universal
vscjava.vscode-gradle-3.17.0-universal
oguhpereira.spotify-color-theme-1.3.0
vscjava.vscode-java-pack-0.30.2
vscjava.vscode-java-pack-0.30.2-universal
vscjava.vscode-java-debug-0.58.2
mechatroner.rainbow-csv-3.19.0
ms-vscode.cpptools-1.23.6-darwin-arm64
vscjava.vscode-java-test-0.43.1
visualstudioexptteam.vscodeintellicode-1.3.1
shyykoserhiy.vscode-spotify-3.2.1
ms-python.python-2025.6.1-darwin-arm64
ecmel.vscode-html-css-2.0.13
ms-python.vscode-pylance-2024.8.1
ms-vscode.cmake-tools-1.21.36-universal
ms-vscode-remote.remote-wsl-0.81.8
vscjava.vscode-maven-0.44.0
