anysphere.cursorpyright@1.0.9
ecmel.vscode-html-css@2.0.13
formulahendry.code-runner@0.12.2
mechatroner.rainbow-csv@3.19.0
ms-azuretools.vscode-docker@2.0.0
ms-python.debugpy@2025.10.0
ms-python.python@2025.6.1
ms-vscode-remote.remote-containers@0.394.0
ms-vscode-remote.remote-wsl@0.81.8
ms-vscode.cmake-tools@1.21.36
ms-vscode.cpptools-extension-pack@1.3.1
ms-vscode.cpptools-themes@2.0.0
ms-vscode.cpptools@1.23.6
oguhpereira.spotify-color-theme@1.3.0
pkief.material-icon-theme@5.27.0
redhat.java@1.46.0
robbowen.synthwave-vscode@0.1.20
shyykoserhiy.vscode-spotify@3.2.1
visualstudioexptteam.intellicode-api-usage-examples@0.2.9
visualstudioexptteam.vscodeintellicode@1.3.2
vscjava.vscode-gradle@3.17.0
vscjava.vscode-java-debug@0.58.2
vscjava.vscode-java-dependency@0.25.0
vscjava.vscode-java-pack@0.30.2
vscjava.vscode-java-test@0.43.1
vscjava.vscode-maven@0.44.0
